<a href="https://colab.research.google.com/github/KY-39/platforma_udt/blob/main/%D0%A0%D0%B0%D0%B1%D0%BE%D1%82%D0%B0_%D1%81_%D1%82%D0%B0%D0%B1%D0%BB%D0%B8%D1%86%D0%B0%D0%BC%D0%B8_%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85_%D0%BD%D0%B0_%D0%BF%D1%80%D0%B8%D0%BC%D0%B5%D1%80%D0%B5_Pandas_%D0%A7%D0%B0%D1%81%D1%82%D1%8C_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## ООО "Университет Цифровых Технологий платформа 3"

#Работа с таблицами данных на примере Pandas. Часть 1 - д.з.

#Домашнее задание

## Уровень базовый

### Задание 1

импортируйте библиотеку pandas,  выведите на экран номер версии библиотеки

In [ ]:
import pandas as pd

In [ ]:
print(pd.__version__)

1.1.5

### Задание 2

Создайте список из 10 целых чисел.

Из списка создайте объект pd.Series

Bыведине на экран полученный объект pd.Series с без использования print

Bыведине на экран полученный объект pd.Series с использованием функции print

Выведите на экран тип объекта используя встроенную функцию type

Выведите на экран тип значений, хранящихся в объекте pd.Series

Найдите минимальное и максимальное значение.

In [ ]:
import random
x = [random.randint(-10, 10) for _ in range(10)]
x

[-7, -2, 7, 1, 5, 5, -8, 4, 5, 9]

In [ ]:
y = pd.Series(x)
y

0   -7
1   -2
2    7
3    1
4    5
5    5
6   -8
7    4
8    5
9    9
dtype: int64

In [ ]:
print(y)

0   -7
1   -2
2    7
3    1
4    5
5    5
6   -8
7    4
8    5
9    9
dtype: int64

In [ ]:
type(y)

pandas.core.series.Series

In [ ]:
y.dtype

dtype('int64')

In [ ]:
y.min()

-8

In [ ]:
y.max()

9

### Задание 3

Вы провели серию экспериментов по обучению нейронной сети по задаче классификации.

Результаты занесли в таблицу

> id | N_neurons | Loss | Accurasy
>--- | --- |--- | ---  
> 0 | 16 | 0.15 | 0.95
> 1| 32 | 0.12 | 0.97
> 2| 64 | 0.11 | 0.98
> 3| 128 | 0.13 | 0.96

Создайте три объекта pd.Series, хранящие данные о количестве нейронов, функции потерь (loss) и точности класификации (accuracy).

Из полученных объектов pd.Series создайте DataFrame (подсказка, используйте подход "через словарь")

In [ ]:
N_neurons = pd.Series([16, 32, 64, 128])
Loss = pd.Series([0.15, 0.12, 0.11, 0.13])
Accuracy = pd.Series([0.95, 0.97, 0.98, 0.96])

In [ ]:
df = pd.DataFrame({'N_neurons' : N_neurons,
                   'Loss' : Loss,
                   'Accuracy' : Accuracy})
df

   N_neurons  Loss  Accuracy
0         16  0.15      0.95
1         32  0.12      0.97
2         64  0.11      0.98
3        128  0.13      0.96

### Задание 4

Для DataFrame, полученного в задании 3 выведите.



1. Первые две строки (записи)
2. Последние две строки
3. Размерность (количество строк и столбцов)
4. Количество элементов
5. Тип объекта
6. Тип любой колонки с данными
7. Информацию о типе колонок и количество непустых значений в каждой колонке.

In [ ]:
df.head(2)

   N_neurons  Loss  Accuracy
0         16  0.15      0.95
1         32  0.12      0.97

In [ ]:
df.tail(2)

   N_neurons  Loss  Accuracy
2         64  0.11      0.98
3        128  0.13      0.96

In [ ]:
df.shape

(4, 3)

In [ ]:
df.size

12

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
type(df.N_neurons)

pandas.core.series.Series

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   N_neurons  4 non-null      int64
 1   Loss       4 non-null      float64
 2   Accuracy   4 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 224.0 bytes

### Задание 5

Для DataFrame из задания 3 найдите
1. среднее количество нейронов
2. минимальное значение для Loss
3. максимальное значение для Accuracy


Выведите описательные статистики для DataFrame

In [ ]:
df.N_neurons.mean()

60.0

In [ ]:
df.Loss.min()

0.11

In [ ]:
df.Accuracy.max()

0.98

## Уровень Основной

### Задание 1

Загрузите данные по дождям в Австралии из файла weatherAUS.csv
Файл доступен по ссылке:
http://dataudt.ru/datasets/weatherAUS.csv

Для этого:
1.   Загрузите файл на Google Disk
2.   Подключите Gooogle Disk к сессии Colab
3.   Загрузите данные из файла csv в DataFrame

Убедитесь, что чтение произошло корректно, для этого выведите 3 первых и 3 последних строк полученного DataFrame.

Выведите количество строк и столбцов в полученном DataFrame

In [ ]:
!wget http://dataudt.ru/datasets/weatherAUS.csv

--2021-11-28 00:32:49--  http://dataudt.ru/datasets/weatherAUS.csv
Resolving dataudt.ru (dataudt.ru)... 37.228.117.130
Connecting to dataudt.ru (dataudt.ru)|37.228.117.130|:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 14094055 (13M) [application/octet-stream]
Saving to: ‘weatherAUS.csv’

weatherAUS.csv      100%[===================>]  13.44M  8.27MB/s    in 1.6s

2021-11-28 00:32:51 (8.27 MB/s) - ‘weatherAUS.csv’ saved [14094055/14094055]

In [ ]:
df = pd.read_csv('/content/weatherAUS.csv')
df

              Date Location  MinTemp  ...  Temp3pm  RainToday  RainTomorrow
0       2008-12-01   Albury     13.4  ...     21.8         No            No
1       2008-12-02   Albury      7.4  ...     24.3         No            No
2       2008-12-03   Albury     12.9  ...     23.2         No            No
3       2008-12-04   Albury      9.2  ...     26.5         No            No
4       2008-12-05   Albury     17.5  ...     29.7         No            No
...            ...      ...      ...  ...      ...        ...           ...
145455  2017-06-21    Uluru      2.8  ...     22.4         No            No
145456  2017-06-22    Uluru      3.6  ...     24.5         No            No
145457  2017-06-23    Uluru      5.4  ...     26.1         No            No
145458  2017-06-24    Uluru      7.8  ...     26.0         No            No
145459  2017-06-25    Uluru     14.9  ...     20.9         No           NaN

[145460 rows x 23 columns]

### Задание 2

Создайте новый DataFrame, содержащий копию столбцов Date, Location, MinTemp, MaxTemp. 
Выведите информацию о новом DataFrame (колонки, количество и тип объектов)
Посчитайте количество пропусков в колонках MinTemp и MaxTemp.

In [ ]:
df_tmp = df[['Date', 'Location', 'MinTemp', 'MaxTemp']].copy()
df_tmp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145460 entries, 0 to 145459
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   Date      145460 non-null  object
 1   Location  145460 non-null  object
 2   MinTemp   143975 non-null  float64
 3   MaxTemp   144199 non-null  float64
dtypes: float64(2), object(2)
memory usage: 4.4+ MB

In [ ]:
df_tmp.MinTemp.isna().sum()

1485

In [ ]:
df_tmp.MaxTemp.isna().sum()

1261

### Задание 3

1. Выведите описательный статистики для полученного DataFrame
2. Выведите все уникальные значения в колонке Location
3. Выведите количество уникальных занчений в колонке Location

In [ ]:
df_tmp.describe()

             MinTemp        MaxTemp
count  143975.000000  144199.000000
mean       12.194034      23.221348
std         6.398495       7.119049
min        -8.500000      -4.800000
25%         7.600000      17.900000
50%        12.000000      22.600000
75%        16.900000      28.200000
max        33.900000      48.100000

In [ ]:
df_tmp.Location.unique()

array(['Albury', 'BadgerysCreek', 'Cobar', 'CoffsHarbour', 'Moree',
       'Newcastle', 'NorahHead', 'NorfolkIsland', 'Penrith', 'Richmond',
       'Sydney', 'SydneyAirport', 'WaggaWagga', 'Williamtown',
       'Wollongong', 'Canberra', 'Tuggeranong', 'MountGinini', 'Ballarat',
       'Bendigo', 'Sale', 'MelbourneAirport', 'Melbourne', 'Mildura',
       'Nhil', 'Portland', 'Watsonia', 'Dartmoor', 'Brisbane', 'Cairns',
       'GoldCoast', 'Townsville', 'Adelaide', 'MountGambier', 'Nuriootpa',
       'Woomera', 'Albany', 'Witchcliffe', 'PearceRAAF', 'PerthAirport',
       'Perth', 'SalmonGums', 'Walpole', 'Hobart', 'Launceston',
       'AliceSprings', 'Darwin', 'Katherine', 'Uluru'], dtype=object)

In [ ]:
df_tmp.Location.nunique()

49

### Задание 4

Cохраните количество строк в DataFrame в переменную.
Удалите все строки, в которых есть хотя-бы один пропуск.
Подсчитайте, сколько строк было удалено.

In [ ]:
counter = df_tmp.shape[0]
df_tmp.dropna(axis=0, how='any', inplace=True)
counter - df_tmp.shape[0]

1881

### Задание 5

Создайте колонку Delta_temp, в которой будет храниться разница между максимальной и минимальное дневными температурами.

In [ ]:
df_tmp['Delta_temp'] = df_tmp.MaxTemp - df_tmp.MinTemp
df_tmp

              Date Location  MinTemp  MaxTemp  Delta_temp
0       2008-12-01   Albury     13.4     22.9         9.5
1       2008-12-02   Albury      7.4     25.1        17.7
2       2008-12-03   Albury     12.9     25.7        12.8
3       2008-12-04   Albury      9.2     28.0        18.8
4       2008-12-05   Albury     17.5     32.3        14.8
...            ...      ...      ...      ...         ...
145454  2017-06-20    Uluru      3.5     21.8        18.3
145455  2017-06-21    Uluru      2.8     23.4        20.6
145456  2017-06-22    Uluru      3.6     25.3        21.7
145457  2017-06-23    Uluru      5.4     26.9        21.5
145458  2017-06-24    Uluru      7.8     27.0        19.2

[143579 rows x 5 columns]

## Уровень Продвинутый

### Задание 1

Загрузите базу шоу и фильмов Netflix из файла netflix_titles.csv. В качестве индекса используйте колонку show_id. Выведите первые 5 строк что-бы проверить результат.
http://dataudt.ru/datasets/netflix_titles.csv

Сделайте переиндексацию полученного DataFrame с удалением текущего индекса.
Выведите первые 5 строк полученной таблицы.

In [ ]:
!wget http://dataudt.ru/datasets/netflix_titles.csv

--2021-11-28 00:53:31--  http://dataudt.ru/datasets/netflix_titles.csv
Resolving dataudt.ru (dataudt.ru)... 37.228.117.130
Connecting to dataudt.ru (dataudt.ru)|37.228.117.130|:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 3000491 (2.9M) [application/octet-stream]
Saving to: ‘netflix_titles.csv’

netflix_titles.csv  100%[===================>]   2.86M  3.29MB/s    in 0.9s

2021-11-28 00:53:32 (3.29 MB/s) - ‘netflix_titles.csv’ saved [3000491/3000491]

In [ ]:
df = pd.read_csv('/content/netflix_titles.csv', index_col='show_id')
df

            type  ...                                        description
show_id           ...
s1       TV Show  ...  In a future where the elite inhabit an island ...
s2         Movie  ...  After a devastating earthquake hits Mexico Cit...
s3         Movie  ...  When an army recruit is found dead, his fellow...
s4         Movie  ...  In a postapocalyptic world, rag-doll robots hi...
s5         Movie  ...  A brilliant group of students become card-coun...
...          ...  ...                                                ...
s7783      Movie  ...  When Lebanon's Civil War deprives Zozo of his ...
s7784      Movie  ...  A scrappy but poor boy worms his way into a ty...
s7785      Movie  ...  In this documentary, South African rapper Nast...
s7786    TV Show  ...  Dessert wizard Adriano Zumbo looks for the nex...
s7787      Movie  ...  This documentary delves into the mystique behi...

[7787 rows x 11 columns]

In [ ]:
df.reset_index(drop=True, inplace=True)
df

         type  ...                                        description
0     TV Show  ...  In a future where the elite inhabit an island ...
1       Movie  ...  After a devastating earthquake hits Mexico Cit...
2       Movie  ...  When an army recruit is found dead, his fellow...
3       Movie  ...  In a postapocalyptic world, rag-doll robots hi...
4       Movie  ...  A brilliant group of students become card-coun...
...       ...  ...                                                ...
7782    Movie  ...  When Lebanon's Civil War deprives Zozo of his ...
7783    Movie  ...  A scrappy but poor boy worms his way into a ty...
7784    Movie  ...  In this documentary, South African rapper Nast...
7785  TV Show  ...  Dessert wizard Adriano Zumbo looks for the nex...
7786    Movie  ...  This documentary delves into the mystique behi...

[7787 rows x 11 columns]

### Задание 2

1. Выведите информацию о колонках, количестве непустых значений и типе хранимых данных.
2. Заполните пропуске в колонках director и cast значением '' (пустая строка)
3. Заполните пропуски в колонке date_added значением 'January 1, 2020'
4. Найдите самые часто встречающиеся значения в колонках country и rating. Заполните ими пропуски в соответствующих колонках.
5. Повторно выведите информацию о колонках и количестве пропусков что-бы проверить что мы избавились от пустых значений

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   type          7787 non-null   object
 1   title         7787 non-null   object
 2   director      5398 non-null   object
 3   cast          7069 non-null   object
 4   country       7280 non-null   object
 5   date_added    7777 non-null   object
 6   release_year  7787 non-null   int64
 7   rating        7780 non-null   object
 8   duration      7787 non-null   object
 9   listed_in     7787 non-null   object
 10  description   7787 non-null   object
dtypes: int64(1), object(10)
memory usage: 669.3+ KB

In [ ]:
df.director.fillna('', inplace=True) 
df.cast.fillna('', inplace=True)
df.date_added.fillna('January 1, 2020', inplace=True)
df.rating.fillna(df.rating.mode()[0], inplace=True) 
df.country.fillna(df.country.mode()[0], inplace=True)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   type          7787 non-null   object
 1   title         7787 non-null   object
 2   director      7787 non-null   object
 3   cast          7787 non-null   object
 4   country       7787 non-null   object
 5   date_added    7787 non-null   object
 6   release_year  7787 non-null   int64
 7   rating        7787 non-null   object
 8   duration      7787 non-null   object
 9   listed_in     7787 non-null   object
 10  description   7787 non-null   object
dtypes: int64(1), object(10)
memory usage: 669.3+ KB

### Задание 3

1. Вычислите количество уникальных записей в колонке country
2. Выведите Топ-5 стран, из которых больше всего шоу в базе.
3. Выведите все шоу, снятые в стране 'Vietnam'
4. Вывелиие все уникальные значения, присутствующие в колонке rating

In [ ]:
df.country.nunique()

681

In [ ]:
df.country.value_counts()[:5]

United States     3062
India              923
United Kingdom     397
Japan              226
South Korea        183
Name: country, dtype: int64

In [ ]:
df[df.country == 'Vietnam']

       type  ...                                        description
939   Movie  ...  A unconventional, efficient Interpol special a...
1482  Movie  ...  In the wake of her husband's betrayal, a novel...
2318  Movie  ...  When traffickers kidnap her daughter from thei...
3105  Movie  ...  A lottery ticket salesperson faces an ethical ...
5654  Movie  ...  From the preparations to the performances, thi...

[5 rows x 11 columns]

In [ ]:
df.rating.unique()

array(['TV-MA', 'R', 'PG-13', 'TV-14', 'TV-PG', 'NR', 'TV-G', 'TV-Y',
       'TV-Y7', 'PG', 'G', 'NC-17', 'TV-Y7-FV', 'UR'], dtype=object)

### Задание 4

Найдите количество шоу, выпущенных в United States d 2018 году

In [ ]:
df[(df.country == 'United States') & (df.release_year  == 2018)].shape[0]

448

### Задание 5

Найдите самого продуктивного режиссера в 2019 году (по количеству выпущенных продуктов).

In [ ]:
df[df.release_year == 2019].director.value_counts()[:5]

                    418
Fernando Ayllón       4
Lucas Margutti        3
Prakash Satam         3
Ashwin Saravanan      3
Name: director, dtype: int64

## Уровень Профессиональный

### Задание 1

Загрузите базу шоу и фильмов Netflix из файла netflix_titles.csv.
Выведите первые 5 строк что-бы проверить результат.
Удалите колонку show_id.
Заполните пропуски в колонке country значением "unknown"

http://dataudt.ru/datasets/netflix_titles.csv

In [ ]:
df = pd.read_csv('/content/netflix_titles.csv')
df.head()

  show_id  ...                                        description
0      s1  ...  In a future where the elite inhabit an island ...
1      s2  ...  After a devastating earthquake hits Mexico Cit...
2      s3  ...  When an army recruit is found dead, his fellow...
3      s4  ...  In a postapocalyptic world, rag-doll robots hi...
4      s5  ...  A brilliant group of students become card-coun...

[5 rows x 12 columns]

In [ ]:
df.drop('show_id', axis=1, inplace=True)
df.country.fillna('unknown', inplace=True)
df

         type  ...                                        description
0     TV Show  ...  In a future where the elite inhabit an island ...
1       Movie  ...  After a devastating earthquake hits Mexico Cit...
2       Movie  ...  When an army recruit is found dead, his fellow...
3       Movie  ...  In a postapocalyptic world, rag-doll robots hi...
4       Movie  ...  A brilliant group of students become card-coun...
...       ...  ...                                                ...
7782    Movie  ...  When Lebanon's Civil War deprives Zozo of his ...
7783    Movie  ...  A scrappy but poor boy worms his way into a ty...
7784    Movie  ...  In this documentary, South African rapper Nast...
7785  TV Show  ...  Dessert wizard Adriano Zumbo looks for the nex...
7786    Movie  ...  This documentary delves into the mystique behi...

[7787 rows x 11 columns]

### Задание 2

Найдите количество уникальных стран, которые присутствуют в колонке country.
Обратите внимание, что в некоторых записях с колонке country перечисляются несколько стран через запятую.

Подсказка - вам может помочь метод df['country'].str.split()

In [ ]:
unique_countries = set()

for country in df['country'].str.split(', '):
  unique_countries.update(set(country))

len(unique_countries)

122

### Задание 3

Найдите среднюю продолжительность фильма в минутах.

In [ ]:
df[df.type == 'Movie'].duration.str.split(' ').apply(lambda x: int(x[0])).mean()

99.30797842663195